# Series Object in Pandas

In [1]:
import pandas as pd
data = [1,2,3,4]
series1 = pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
type(series1)

pandas.core.series.Series

In [3]:
# Changing the index of a Series Object
series1 = pd.Series(data, index = ['a','b','c','d'])
series1

a    1
b    2
c    3
d    4
dtype: int64

# How to create a DataFrame

In [5]:
# creating a dataframe using list
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
#creating a dataframe using dictionary
dictionary = {'fruits': ['apples', 'banana', 'mangoes'], 'count': [10,20,15]}
df = pd.DataFrame(dictionary)
df

    fruits  count
0   apples     10
1   banana     20
2  mangoes     15

In [7]:
#creating a dataframe using a series
series = pd.Series([6,12], index= ['a','b'])
df = pd.DataFrame(series)
df

    0
a   6
b  12

In [8]:
#creating a dataframe using numpy array
import numpy as np
nparray = np.array([[5000,6000],['John','James']])
df = pd.DataFrame({'name': nparray[1], 'salary':nparray[0]})
df

    name salary
0   John   5000
1  James   6000

# How to perform Merge Operation

In [9]:
player = ['player1', 'player2', 'player3']
point = [8,9,6]
title = ['Game1', 'Game2', 'Game3']
df1 = pd.DataFrame({'Player': player, 'Point': point, 'Title': title})
df1

    Player  Point  Title
0  player1      8  Game1
1  player2      9  Game2
2  player3      6  Game3

In [10]:
player = ['player1', 'player5', 'player6']
power = ['punch','kick', 'elboy']
title = ['Game1', 'Game5','Gmae6']
df2 = pd.DataFrame({'Player': player, 'Power': power, 'Title': title})
df2

    Player  Power  Title
0  player1  punch  Game1
1  player5   kick  Game5
2  player6  elboy  Gmae6

In [12]:
#Inner Merge
df1.merge(df2, on='Title', how = 'inner') #default is inner

  Player_x  Point  Title Player_y  Power
0  player1      8  Game1  player1  punch

In [13]:
#Left Merge
df1.merge(df2, on='Player', how='left')

    Player  Point Title_x  Power Title_y
0  player1      8   Game1  punch   Game1
1  player2      9   Game2    NaN     NaN
2  player3      6   Game3    NaN     NaN

In [14]:
# Right Merge
df1.merge(df2, on='Player', how='right')

    Player  Point Title_x  Power Title_y
0  player1    8.0   Game1  punch   Game1
1  player5    NaN     NaN   kick   Game5
2  player6    NaN     NaN  elboy   Gmae6

In [15]:
# Outer Merge
df1.merge(df2, on='Player', how='outer')

    Player  Point Title_x  Power Title_y
0  player1    8.0   Game1  punch   Game1
1  player2    9.0   Game2    NaN     NaN
2  player3    6.0   Game3    NaN     NaN
3  player5    NaN     NaN   kick   Game5
4  player6    NaN     NaN  elboy   Gmae6

# How to perform Join Operation in Pandas

In [22]:
player = ['player1', 'player2', 'player3']
point = [8,9,6]
title = ['Game1', 'Game2', 'Game3']
df3 = pd.DataFrame({'Player': player, 'Point': point, 'Title': title}, index = ['l1','l2','l3'])
df3

     Player  Point  Title
l1  player1      8  Game1
l2  player2      9  Game2
l3  player3      6  Game3

In [25]:
player = ['player1', 'player5', 'player6']
power = ['punch','kick', 'elboy']
title = ['Game1', 'Game5','Gmae6']
df4 = pd.DataFrame({'Players': player, 'Power': power, 'Titles': title}, index = ['l2','l3','l4'])
df4

    Players  Power Titles
l2  player1  punch  Game1
l3  player5   kick  Game5
l4  player6  elboy  Gmae6

In [26]:
# inner join
df3.join(df4, how='inner')

     Player  Point  Title  Players  Power Titles
l2  player2      9  Game2  player1  punch  Game1
l3  player3      6  Game3  player5   kick  Game5

In [27]:
#left join
df3.join(df4, how='left')

     Player  Point  Title  Players  Power Titles
l1  player1      8  Game1      NaN    NaN    NaN
l2  player2      9  Game2  player1  punch  Game1
l3  player3      6  Game3  player5   kick  Game5

In [28]:
#right join
df3.join(df4, how='right')

     Player  Point  Title  Players  Power Titles
l2  player2    9.0  Game2  player1  punch  Game1
l3  player3    6.0  Game3  player5   kick  Game5
l4      NaN    NaN    NaN  player6  elboy  Gmae6

In [29]:
#outer join
df3.join(df4, how='outer')

     Player  Point  Title  Players  Power Titles
l1  player1    8.0  Game1      NaN    NaN    NaN
l2  player2    9.0  Game2  player1  punch  Game1
l3  player3    6.0  Game3  player5   kick  Game5
l4      NaN    NaN    NaN  player6  elboy  Gmae6

# How to concatinate two dfs in pandas

In [30]:
pd.concat([df3,df4])

     Player  Point  Title  Players  Power Titles
l1  player1    8.0  Game1      NaN    NaN    NaN
l2  player2    9.0  Game2      NaN    NaN    NaN
l3  player3    6.0  Game3      NaN    NaN    NaN
l2      NaN    NaN    NaN  player1  punch  Game1
l3      NaN    NaN    NaN  player5   kick  Game5
l4      NaN    NaN    NaN  player6  elboy  Gmae6